poc/consumer/examples/request-saml20-hok.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
	<soap11:Header>
		<wsa:MessageID wsu:Id="_9a73d79a-7f98-481a-89ef-9b57610f0ef5" xmlns:wsa="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">f63d289c-cd9a-4c00-bf87-c4bad0310646</wsa:MessageID>
		<sbf:Framework NS1:profile="egovsimple" version="2.0" wsu:Id="_cf4eeb8e-4e72-45ed-a26d-936f0b48cb81" xmlns:NS1="urn:liberty:sb:eGov"
			xmlns:sbf="urn:liberty:sb:2006-08" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" />
		<wsse:Security soap11:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsu:Timestamp wsu:Id="_32c2df0c-1caa-45af-985c-7385836cd584" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<wsu:Created>2008-11-05T13:58:29.976Z</wsu:Created>
				<wsu:Expires>2008-11-05T14:08:29.976Z</wsu:Expires>
			</wsu:Timestamp>
			<saml:Assertion ID="urn:uuid:65298DF4C246BB1A84122589380978066" IssueInstant="2008-11-05T14:03:29.780Z" Version="2.0"
				xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol">
				<saml:Issuer xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">http://localhost:8088/TokenService/services/Trust
				</saml:Issuer>
				<saml:Subject xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
					<saml:NameID Format="urn:test"> joetest</saml:NameID>
					<saml:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml:SubjectConfirmationData Recipient="urn:appliesto" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
							xsi:type="saml:KeyInfoConfirmationDataType">
							<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
								<ds:X509Data>
									<ds:X509Certificate>MIIBQTCB7AIDAIW6MA0GCSqGSIb3DQEBBQUAMCsxCzAJBgNVBAYTAkRLMQ0wCwYDVQQKDAR0ZXN0
										MQ0wCwYDVQQLDAR0ZXN0MB4XDTA4MTEwNTE0MDMxOVoXDTA4MTEwNTE0MDUwOVowKzELMAkGA1UE
										BhMCREsxDTALBgNVBAoMBHRlc3QxDTALBgNVBAsMBHRlc3QwXDANBgkqhkiG9w0BAQEFAANLADBI
										AkEAlRbYSikVn4qnZpdguy5BdnCVp99koQrcEDmrWMx+o1Rkl6q+UPRcehSeHe9sC7LZi4DRff5H
										cYQ+zlgO1HDLgwIDAQABMA0GCSqGSIb3DQEBBQUAA0EAIrRbB9e5hRqUyrLc+zlIXeSh0ija+man
										pWv2gdwkqh/iT62qDPbyBuocK7a31l7Ijt+zI1xiQ3OwysJE4K04HA==</ds:X509Certificate>
								</ds:X509Data>
							</ds:KeyInfo>
						</saml:SubjectConfirmationData>
					</saml:SubjectConfirmation>
				</saml:Subject>
				<saml:Conditions NotBefore="2008-11-05T14:03:29.780Z" NotOnOrAfter="2008-11-12T14:03:29.780Z" xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
					<saml:AudienceRestriction>
						<saml:Audience>urn:appliesto</saml:Audience>
					</saml:AudienceRestriction>
				</saml:Conditions>
				<saml:AttributeStatement xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
					<saml:Attribute Name="dk:gov:saml:attribute:AssuranceLevel" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:basic">
						<saml:AttributeValue>2</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
						<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
						<ds:Reference URI="#urn:uuid:65298DF4C246BB1A84122589380978066" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
							<ds:Transforms xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
								<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" />
							<ds:DigestValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">TIAOX9gRWaUguSDuMwAgo+HfBmQ=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">AaxaDuyPK/dVhjyCEKFcUlS13euYxWN+yv9XEqUT7AfokG7FF7EGoDVgDxn/cB9SZDrS7qRAiHbP
						t2oNUPXg2NY2mz4v8YIo3p3GSbwu3ZTXuYpMmVM2CMPR6wRgqaPVcSQ8FGRsRbq9qOWlUq1dSzoP 3Uz5+8OpjI1A/3KCgMM=</ds:SignatureValue>
					<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
						<ds:X509Data xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
							<ds:X509Certificate xmlns:ds="http://www.w3.org/2000/09/xmldsig#">MIIFEjCCBHugAwIBAgIEQDasETANBgkqhkiG9w0BAQUFADA/MQswCQYDVQQGEwJESzEMMAoGA1UE
								ChMDVERDMSIwIAYDVQQDExlUREMgT0NFUyBTeXN0ZW10ZXN0IENBIElJMB4XDTA3MDYwODA4MjIz
								M1oXDTA5MDYwODA4NTIzM1owgZExCzAJBgNVBAYTAkRLMS8wLQYDVQQKFCZUREMgVE9UQUxM2FNO
								SU5HRVIgQS9TIC8vIENWUjoyNTc2NzUzNTFRMCUGA1UEBRMeQ1ZSOjI1NzY3NTM1LVVJRDoxMTAw
								MDgwMTMwNTk3MCgGA1UEAxQhVERDIFRPVEFMTNhTTklOR0VSIEEvUyAtIFREQyBUZXN0MIGfMA0G
								CSqGSIb3DQEBAQUAA4GNADCBiQKBgQC8IT7+NERFT19vJkAH+SuwBnSQRZuZezn2dGGtLudL7lxd
								ZsX4KtdK9GImW31h48rKjPsGEQ7nAsjwmAiWBzqE+4ySUCDjVP1r0t3hcIRDjyTmAYb1L1M0+jB+
								2j5ApVJU4bXl4K73oKKH4dau7lkOytg73wap7qPxGYgXbc8eZwIDAQABo4ICxjCCAsIwDgYDVR0P
								AQH/BAQDAgO4MCsGA1UdEAQkMCKADzIwMDcwNjA4MDgyMjMzWoEPMjAwOTA2MDgwODUyMzNaMEYG
								CCsGAQUFBwEBBDowODA2BggrBgEFBQcwAYYqaHR0cDovL3Rlc3Qub2NzcC5jZXJ0aWZpa2F0LmRr
								L29jc3Avc3RhdHVzMIIBAwYDVR0gBIH7MIH4MIH1BgkpAQEBAQEBAQMwgecwLwYIKwYBBQUHAgEW
								I2h0dHA6Ly93d3cuY2VydGlmaWthdC5kay9yZXBvc2l0b3J5MIGzBggrBgEFBQcCAjCBpjAKFgNU
								REMwAwIBARqBl1REQyBUZXN0IENlcnRpZmlrYXRlciBmcmEgZGVubmUgQ0EgdWRzdGVkZXMgdW5k
								ZXIgT0lEIDEuMS4xLjEuMS4xLjEuMS4xLjMuIFREQyBUZXN0IENlcnRpZmljYXRlcyBmcm9tIHRo
								aXMgQ0EgYXJlIGlzc3VlZCB1bmRlciBPSUQgMS4xLjEuMS4xLjEuMS4xLjEuMy4wFwYJYIZIAYb4
								QgENBAoWCG9yZ2FuV2ViMBwGA1UdEQQVMBOBEWNlcnRpZmlrYXRAdGRjLmRrMIGWBgNVHR8EgY4w
								gYswVqBUoFKkUDBOMQswCQYDVQQGEwJESzEMMAoGA1UEChMDVERDMSIwIAYDVQQDExlUREMgT0NF
								UyBTeXN0ZW10ZXN0IENBIElJMQ0wCwYDVQQDEwRDUkw1MDGgL6AthitodHRwOi8vdGVzdC5jcmwu
								b2Nlcy5jZXJ0aWZpa2F0LmRrL29jZXMuY3JsMB8GA1UdIwQYMBaAFByYCUcaTDi5EMUEKVvx9E6A
								asx+MB0GA1UdDgQWBBRleNffSNDK4jqx7uV5ITqAcZ0+XTAJBgNVHRMEAjAAMBkGCSqGSIb2fQdB
								AAQMMAobBFY3LjEDAgOoMA0GCSqGSIb3DQEBBQUAA4GBAJ4w+6UOvcyGgs5lWoAzksD4q0yRrZ93
								ckI3DZ3GPfSk5Cjrluz8I41Q6uyRR8gdq70pYsp4pg0d9zPEeRF7E6a6YgKZrCncVaAdli4ZVyEc
								FDoCuYDE89iXgyFhPd1txIF8kvOepbPtCyJrU6nKAt3l1NDmvlcoIOaw9azmSB8/</ds:X509Certificate>
						</ds:X509Data>
						<ds:KeyValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
							<ds:RSAKeyValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
								<ds:Modulus xmlns:ds="http://www.w3.org/2000/09/xmldsig#">vCE+/jRERU9fbyZAB/krsAZ0kEWbmXs59nRhrS7nS+5cXWbF+CrXSvRiJlt9YePKyoz7BhEO5wLI
									8JgIlgc6hPuMklAg41T9a9Ld4XCEQ48k5gGG9S9TNPowfto+QKVSVOG15eCu96Cih+HWru5ZDsrY O98Gqe6j8RmIF23PHmc=</ds:Modulus>
								<ds:Exponent xmlns:ds="http://www.w3.org/2000/09/xmldsig#">AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
			</saml:Assertion>
			<wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0"
				wsu:Id="_4956d071-b0d0-4959-87de-ddcc2f14536d" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
					ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">urn:uuid:65298DF4C246BB1A84122589380978066</wsse:KeyIdentifier>
			</wsse:SecurityTokenReference>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#_e34e658a-a6e1-4363-a78a-317aa7d604cb">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces PrefixList="xsd" xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>BNg/3thCq+noh7j+i00jBSgO5iA=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_32c2df0c-1caa-45af-985c-7385836cd584">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces PrefixList="xsd" xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>+r/kSEzUdp3qthuf+UatzC/pOKg=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_1f155cf0-7364-4055-b503-4b9c22fd5a16">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces PrefixList="xsd" xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>nV6amBZ1aqu1TctbiPCgXoDZxmU=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_c045836a-3139-429b-8a44-8ce8c6036303">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces PrefixList="xsd" xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>m9vMlpJV4DaiiOeuezJUnmvmN3s=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_cf4eeb8e-4e72-45ed-a26d-936f0b48cb81">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces PrefixList="xsd" xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>26QMGy3lqdQcSnWzSI9ojfmpga8=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_2135055f-9262-4212-97de-27dd557855fc">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces PrefixList="xsd" xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>C6VOb/1p/guh20eNUARGemTivwo=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_9a73d79a-7f98-481a-89ef-9b57610f0ef5">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<InclusiveNamespaces PrefixList="xsd" xmlns="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>3ulF+08WszQ3z+3uX0e5BNXqTL8=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>ZC0iRGWfZIiudRJTAms4gTWIHoA8phzhkz2qrJlj83SQSiFQflAkMvo+n2XluP0tA4CshRdLDgY+
					ExksoP38cg==</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
						wsu:Id="_0a4915ce-a1ba-4a94-9575-5f27c37798ff" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
						<wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">urn:uuid:65298DF4C246BB1A84122589380978066</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
		<wsa:Action wsu:Id="_2135055f-9262-4212-97de-27dd557855fc" xmlns:wsa="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">http://provider.poc.saml.itst.dk/Provider/echoRequest</wsa:Action>
		<wsa:To wsu:Id="_c045836a-3139-429b-8a44-8ce8c6036303" xmlns:wsa="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">http://localhost:8088/TokenService/services/Trust</wsa:To>
		<wsa:ReplyTo wsu:Id="_1f155cf0-7364-4055-b503-4b9c22fd5a16" xmlns:wsa="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
	</soap11:Header>
	<soap11:Body wsu:Id="_e34e658a-a6e1-4363-a78a-317aa7d604cb" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
		<ns5:echo xmlns:ns5="http://provider.poc.saml.itst.dk/" />
	</soap11:Body>
</soap11:Envelope>
